Revit 2027 API
BuiltInFailures.GeneralFailures.ContentDocTreeCorruption Property
 Problems with the Content Doc Tree structure - e.g. orphaned Content Docs, Families w/o docs, missing Owner Fam, what-not
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContentDocTreeCorruption { get; }
Public Shared ReadOnly Property ContentDocTreeCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContentDocTreeCorruption {
	FailureDefinitionId^ get ();
}
static member ContentDocTreeCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace